In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
#write DF to csv
df.to_csv('new_weather_data.csv') #stores data with index
#it

In [5]:
ndf = pd.read_csv('new_weather_data.csv')
ndf

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [6]:
#to store df without index 
df.to_csv('new_weather_without_index.csv',index=False)

In [7]:
ndf = pd.read_csv('new_weather_without_index.csv')
ndf

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [8]:
df.to_excel('new.xlsx',sheet_name='weather_data')

In [9]:
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [10]:
#group the data by cities and perform different operationson the perticular cities
gb = df.groupby('city')
gb

In [11]:
for city,city_df in gb:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [12]:
#or to get specific group
#print the data related to mumbai
gb.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [13]:
#no of data points related to newyork city
gb.get_group('new york')['day'].count()

4

In [14]:
#find the max forevery city
print(gb.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [15]:
#print the mean temp and windspeed for every city
print(gb.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [16]:
print(gb.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [17]:
#concatinate the data frames
import pandas as pd
india_weather = pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,23],
    "humidity":[80,70,67]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        70           45
2  banglore        67           23

In [18]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
})
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [19]:
#concat two dataframe
#check the index
df = pd.concat([india_weather,us_weather])
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        70           45
2  banglore        67           23
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [20]:
#if you want continuous index
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        70           45
2  banglore        67           23
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [21]:
df = pd.concat([india_weather,us_weather],axis=1)
df

       city  humidity  temperature      city  humidity  temperature
0    mumbai        80           32  new york        68           21
1     delhi        70           45   chicago        65           14
2  banglore        67           23   orlando        75           35

In [23]:
#merge dataframe
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35],
    
})

In [24]:
us_wet = pd.DataFrame({
    "city":["new york","chicago"],
    "humidity":[23,56]
    
})

In [25]:
#it delete the row for which data not available
us_weather.merge(us_wet,on="city")

       city  temperature  humidity
0  new york           21        23
1   chicago           14        56

In [26]:
us_weather.merge(us_wet,on="city",how="outer")

       city  temperature  humidity
0  new york           21      23.0
1   chicago           14      56.0
2   orlando           35       NaN

# Numerical Indexing

In [29]:
#default indexing
df = pd.DataFrame([1,2,3,4,5,6])
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [31]:
#with index 
df = pd.DataFrame([1,2,3,4,5,6],index=[6,5,4,3,2,1])
df

   0
6  1
5  2
4  3
3  4
2  5
1  6

In [33]:
#access by index
df.loc[5]

0    2
Name: 5, dtype: int64

In [35]:
#access by row no
df.iloc[2]

0    3
Name: 4, dtype: int64

In [36]:
#print data untill index 2
df.loc[:2]

   0
6  1
5  2
4  3
3  4
2  5

In [37]:
#print first two row
df.iloc[:2]

   0
6  1
5  2